final_project/test_cases/trial_error/base_case/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"

    inlet
    {
      type            fixedValue;
      value	3.432e-5;
    }

    outlet
    {
      type            fixedValue;
      value	3.432e-5;
    }

    wing
    {
      type            fixedValue;
      value           0;
    }
    sym1
    {
      type            fixedValue;
      value	3.432e-5;
    }

    sym2
    {
      type            fixedValue;
      value	3.432e-5;
    }

    top
    {
      type            fixedValue;
      value	3.432e-5;
    }

    bottom
    {
      type            fixedValue;
      value	3.432e-5;
    }
}

// ************************************************************************* //
