final_project/test_cases/trial_error/base_case/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0.0000001;

boundaryField
{

    inlet
    {
      type	calculated;
      value	uniform 8.58e-6;
    }

    outlet
    {
      type	zeroGradient;
    }

    wing
    {
	//type            nutkWallFunction;
      type	fixedValue;
      value	uniform 0;
    }
    sym1
    {
      type	zeroGradient;
    }

    sym2
    {
      type	zeroGradient;
    }

    top
    {
      type	zeroGradient;
    }

    bottom
    {
      type	zeroGradient;
    }
}


// ************************************************************************* //
